'use strict';

// // Задание 1
// // • Используя Symbol.iterator, создайте объект "Музыкальная коллекция", который можно итерировать. Каждая итерация должна возвращать следующий альбом из коллекции.

// // • Создайте объект musicCollection, который содержит массив альбомов и имеет свойство-символ Symbol.iterator. Каждый альбом имеет следующую структуру:

// const musicCollection = [
//   {
//     title: 'First',
//     artist: 'First_performer',
//     year: '1990',
//   },
//   {
//     title: 'Second',
//     artist: 'Second_performer',
//     year: '1992',
//   },
//   {
//     title: 'Third',
//     artist: 'Third_performer',
//     year: '1993',
//   },
// ];

// musicCollection[Symbol.iterator] = function () {
//   return {
//     current: 0,
//     to: this.length,
//     next() {
//       return this.current < this.to
//         ? {
//             done: false,
//             value: musicCollection[this.current++],
//           }
//         : { done: true };
//     },
//   };
// };

// for (const music of musicCollection) {
//   console.log(`Название Альбома: ${music.title}, исполнитель: ${music.artist}, год выпуска: ${music.year}`);
// }

// // • Реализуйте кастомный итератор для объекта musicCollection. Итератор должен перебирать альбомы по порядку.
// // • Используйте цикл for...of для перебора альбомов в музыкальной коллекции и вывода их на консоль в формате: Название альбома - Исполнитель (Год выпуска)

// Задание 2
// Вы управляете рестораном, в котором работают разные повара, специализирующиеся на определенных блюдах. Клиенты приходят и делают заказы на разные блюда.

// Необходимо создать систему управления этими заказами, которая позволит:

// • Отслеживать, какой повар готовит какое блюдо.
// • Записывать, какие блюда заказал каждый клиент.

// Используйте коллекции Map для хранения блюд и их поваров, а также для хранения заказов каждого клиента. В качестве ключей для клиентов используйте объекты.

// Повара и их специализации:

// Виктор - специализация: Пицца.
// Ольга - специализация: Суши.
// Дмитрий - специализация: Десерты.

// Блюда и их повара:

// Пицца "Маргарита" - повар: Виктор.
// Пицца "Пепперони" - повар: Виктор.
// Суши "Филадельфия" - повар: Ольга.
// Суши "Калифорния" - повар: Ольга.
// Тирамису - повар: Дмитрий.
// Чизкейк - повар: Дмитрий.

// Заказы:

// Клиент Алексей заказал: Пиццу "Пепперони" и Тирамису.
// Клиент Мария заказала: Суши "Калифорния" и Пиццу "Маргарита".
// Клиент Ирина заказала: Чизкейк.

const foodChefs = new Map();
foodChefs.set('Виктор', 'специализация: Пицца');
foodChefs.set('Ольга', 'специализация: Суши');
foodChefs.set('Дмитрий', 'специализация: Десерты');
console.log(`Виктор - ${foodChefs.get('Виктор')}`);
console.log(`Ольга - ${foodChefs.get('Ольга')}`);
console.log(`Дмитрий - ${foodChefs.get('Дмитрий')}`);

const chefsMeal = new Map();
chefsMeal.set('Пицца "Маргарита"', 'повар: Виктор');
chefsMeal.set('Пицца "Пепперони"', 'повар: Виктор');
chefsMeal.set('Суши "Филадельфия"', 'повар: Ольга');
chefsMeal.set('Суши "Калифорния"', 'повар: Ольга');
chefsMeal.set('Тирамису', 'повар: Дмитрий');
chefsMeal.set('Чизкейк', 'повар: Дмитрий');
console.log(`Пиццу "Маргаритта" готовит ${chefsMeal.get('Пицца "Маргарита"')}`);
console.log(`Пиццу "Пепперони" готовит ${chefsMeal.get('Пицца "Пепперони"')}`);
console.log(
  `Суши "Филадельфия" готовит ${chefsMeal.get('Суши "Филадельфия"')}`
);
console.log(`Суши "Калифорния" готовит ${chefsMeal.get('Суши "Калифорния"')}`);
console.log(`Тирамису готовит ${chefsMeal.get('Тирамису')}`);
console.log(`Чизкейк готовит ${chefsMeal.get('Чизкейк')}`);

// const clientele = new Map();

// const orders1 = new Set().add('Тирамису').add('Пепперони');

// const orders2 = new Set().add('Суши "Калифорния"').add('Пицца "Маргарита"');

// const orders3 = new Set().add('Чизкейк');

// clientele.set('Алексей', orders1).set('Мария', orders2).set('Ирина', orders3);

// console.log(`Клиент Алексей заказал: ${[...clientele.get("Алексей")]}`);
// console.log(`Клиент Мария заказал: ${[...clientele.get("Мария")]}`);
// console.log(`Клиент Ирина заказал: ${[...clientele.get("Ирина")]}`);
//
//
